RT-Thread-Studio/sdk-csp-gd32h7/drivers/rtt/drv_usart.c
    GD32_UART_IRQHandler(&serial5);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART5 */

#if defined(BSP_USING_UART6)
struct rt_serial_device serial6;

#if defined(RT_SERIAL_USING_DMA)
gd32_uart_dma uart6_rxdma = {
    DMA0,
    DMA_CH6,
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E)
    DMA_REQUEST_UART6_RX,
#endif
    DMA_INTF_FTFIF,
    DMA0_Channel6_IRQn,
    0,
};

void DMA0_Channel6_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial6);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_SERIAL_USING_DMA */

void UART6_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial6);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART6 */

#if defined(BSP_USING_UART7)
struct rt_serial_device serial7;

#if defined(RT_SERIAL_USING_DMA)
gd32_uart_dma uart7_rxdma = {
    DMA0,
    DMA_CH7,
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E)
    DMA_REQUEST_UART7_RX,
#endif
    DMA_INTF_FTFIF,
    DMA0_Channel7_IRQn,
    0,
};

void DMA0_Channel7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial7);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_SERIAL_USING_DMA */

void UART7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial7);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART7 */

static const struct gd32_uart uart_obj[] =
{
#ifdef BSP_USING_UART0
    UART0_CONFIG,
#endif
#ifdef BSP_USING_UART1
    UART1_CONFIG,
#endif
#ifdef BSP_USING_UART2
    UART2_CONFIG,
#endif
#ifdef BSP_USING_UART3
    UART3_CONFIG,
#endif
#ifdef BSP_USING_UART4
    UART4_CONFIG,
#endif
#ifdef BSP_USING_UART5
    UART5_CONFIG,
#endif
#ifdef BSP_USING_UART6
    UART6_CONFIG,
#endif
#ifdef BSP_USING_UART7
    UART7_CONFIG,
#endif
};

int get_uart_pin_config(const char *pin_name, uint32_t *port, uint32_t *pin, rcu_periph_enum *clk)
{
    if (pin_name == NULL || port == NULL || pin == NULL || clk == NULL)
    {
        return -1;
    }

    if (strlen(pin_name) < 3 || pin_name[0] != 'P')
    {
        return -1;
    }

    char port_letter = pin_name[1];
    switch (port_letter)
    {
#ifdef GPIOA
        case 'A':
            *port = GPIOA;
            *clk = RCU_GPIOA;
            break;
#endif /* GPIOA */
#ifdef GPIOB
        case 'B':
            *port = GPIOB;
            *clk = RCU_GPIOB;
            break;
#endif /* GPIOB */
#ifdef GPIOC
        case 'C':
            *port = GPIOC;
            *clk = RCU_GPIOC;
            break;
#endif /* GPIOC */
#ifdef GPIOD
        case 'D':
            *port = GPIOD;
            *clk = RCU_GPIOD;
            break;
#endif /* GPIOD */
#ifdef GPIOE
        case 'E':
            *port = GPIOE;
            *clk = RCU_GPIOE;
            break;
#endif /* GPIOE */
#ifdef GPIOF
        case 'F':
            *port = GPIOF;
            *clk = RCU_GPIOF;
            break;
#endif /* GPIOF */
#ifdef GPIOG
        case 'G':
            *port = GPIOG;
            *clk = RCU_GPIOG;
            break;
#endif /* GPIOG */
#ifdef GPIOH
        case 'H':
            *port = GPIOH;
            *clk = RCU_GPIOH;
            break;
#endif /* GPIOH */
#ifdef GPIOI
        case 'I':
            *port = GPIOI;
            *clk = RCU_GPIOI;
            break;
#endif /* GPIOI */
#ifdef GPIOJ
        case 'J':
            *port = GPIOJ;
            *clk = RCU_GPIOJ;
            break;
#endif /* GPIOJ */
#ifdef GPIOK
        case 'K':
            *port = GPIOK;
            *clk = RCU_GPIOK;
            break;
#endif /* GPIOK */
        default:
            return -1;
    }

    int pin_num = atoi(pin_name + 2);
    if (pin_num < 0 || pin_num > 15)
    {
        return -1;
    }
    *pin = GPIO_PIN_0 << pin_num;

    return 0;
}

int get_uart_alternate_config(const char *alternate, uint32_t *af)
{
    if (alternate == NULL || af == NULL)
    {
        return -1;
    }

    if (strlen(alternate) != 3 || alternate[0] != 'A' || alternate[1] != 'F')
    {
        return -1;
    }

    int af_num = atoi(alternate + 2);
    if (af_num < 0 || af_num > 15)
    {
        return -1;
    }

    switch (af_num)
    {
        case 0: *af = GPIO_AF_0; break;
        case 1: *af = GPIO_AF_1; break;
        case 2: *af = GPIO_AF_2; break;
        case 3: *af = GPIO_AF_3; break;
        case 4: *af = GPIO_AF_4; break;
        case 5: *af = GPIO_AF_5; break;
        case 6: *af = GPIO_AF_6; break;
        case 7: *af = GPIO_AF_7; break;
        case 8: *af = GPIO_AF_8; break;
        case 9: *af = GPIO_AF_9; break;
        case 10: *af = GPIO_AF_10; break;
        case 11: *af = GPIO_AF_11; break;
        case 12: *af = GPIO_AF_12; break;
        case 13: *af = GPIO_AF_13; break;
        case 14: *af = GPIO_AF_14; break;
        case 15: *af = GPIO_AF_15; break;
        default: return -1;
    }

    return 0;
}

/**
* @brief UART MSP Initialization
*        This function configures the hardware resources used in this example:
*           - Peripheral's clock enable
*           - Peripheral's GPIO Configuration
*           - NVIC configuration for UART interrupt request enable
* @param huart: UART handle pointer
* @retval None
*/
void gd32_uart_gpio_init(struct gd32_uart *uart)
{
    rt_uint32_t tx_port, rx_port;
    rt_uint32_t tx_pin, rx_pin;
    rt_uint32_t pin_af;
    rcu_periph_enum tx_periph, rx_periph;

    if (get_uart_pin_config(uart->tx_pin_name, &tx_port, &tx_pin, &tx_periph) != RT_EOK)
    {
        return;
    }

    if (get_uart_pin_config(uart->rx_pin_name, &rx_port, &rx_pin, &rx_periph) != RT_EOK)
    {
        return;
    }

    get_uart_alternate_config(uart->alternate, &pin_af);

    /* enable USART clock */
    rcu_periph_clock_enable(tx_periph);
    rcu_periph_clock_enable(rx_periph);
    rcu_periph_clock_enable(uart->per_clk);

    /* connect port to USARTx_Tx */
    gpio_af_set(tx_port, pin_af, tx_pin);

    /* connect port to USARTx_Rx */
    gpio_af_set(rx_port, pin_af, rx_pin);

    /* configure USART Tx as alternate function push-pull */
    gpio_mode_set(tx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, tx_pin);
    gpio_output_options_set(tx_port, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, tx_pin);

    /* configure USART Rx as alternate function push-pull */
    gpio_mode_set(rx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, rx_pin);
    gpio_output_options_set(rx_port, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, rx_pin);

    NVIC_SetPriority(uart->irqn, 0);
    NVIC_EnableIRQ(uart->irqn);
}

/**
  * @brief  uart configure
  * @param  serial, cfg
  * @retval None
  */
static rt_err_t gd32_uart_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

